app/views/topics/show.html.erb

      </p>
      <% @topic.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."topic_id" = ? ORDER BY created_at DESC  [["topic_id", 2]]

                  submitted <%= time_ago_in_words(post.created_at) %> ago<br>
                  <%= post.comments.count %> Comments
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 17]]