app/views/users/show.html.erb

				<small>
					<%= pluralize(@user.posts.count, "post") %>
					<%= pluralize(@user.comments.count, "comment") %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY rank DESC  [["user_id", 9]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 9]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 9]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 9]]