app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 36], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "I live hawaii!"], ["post_id", 36], ["created_at", 2017-03-17 17:37:49 UTC], ["updated_at", 2017-03-17 17:37:49 UTC], ["user_id", 8]]
---
   def create
      @post = Post.find(params[:post_id])
      comment = @post.comments.new(comment_params)
      comment.user = current_user

      if comment.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 36], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 36], ["id", 101], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 101]]
---
   def destroy
      @post = Post.find(params[:post_id])
      comment = @post.comments.find(params[:id])

      if comment.destroy