app/controllers/favorites_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY rank DESC LIMIT ?  [["id", 46], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 6], ["post_id", 46], ["created_at", 2017-03-20 16:51:27 UTC], ["updated_at", 2017-03-20 16:51:27 UTC]]
---
	def create
		post = Post.find(params[:post_id])
		favorite = current_user.favorites.build(post: post)

		if favorite.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY rank DESC LIMIT ?  [["id", 46], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT ?  [["user_id", 6], ["id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
---
	def destroy
		post = Post.find(params[:post_id])
		favorite = current_user.favorites.find(params[:id])

		if favorite.destroy