app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 41], ["LIMIT", 1]]
---
  def show
    @post = Post.find(params[:id])

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @post = Post.new
    @post.topic = Topic.find(params[:topic_id])

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "topic_id") VALUES (?, ?, ?, ?, ?)  [["title", "hello 1!"], ["body", "hesdfsdfdsfsdfsdfsdfsdfgsdfgb sfbsfgb"], ["created_at", 2017-03-10 21:00:03 UTC], ["updated_at", 2017-03-10 21:00:03 UTC], ["topic_id", 4]]
UPDATE "posts" SET "id" = ?, "title" = ?, "body" = ?, "created_at" = ?, "updated_at" = ?, "topic_id" = ?, "user_id" = ?, "rank" = ? WHERE "posts"."id" = ?
---
  def create
    @post = Post.new
    @post.assign_attributes(post_params)

    @post.topic = Topic.find(params[:topic_id])
    @post.user = current_user

    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Poop"], ["updated_at", 2017-03-08 18:49:59 UTC], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])

    @post.title = params[:post][:title]
    @post.body = params[:post][:body]

    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
---
  def destroy
     @post = Post.find(params[:id])

     if @post.destroy