app/controllers/questions_controller.rb

INSERT INTO "questions" ("title", "body", "resolved", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Which question is this? "], ["body", "it should be the first one. id 0 or 1?"], ["resolved", false], ["created_at", 2017-03-08 20:15:19 UTC], ["updated_at", 2017-03-08 20:15:19 UTC]]
---
  def create
    @question = Question.new

    @question.title = params[:question][:title]
    @question.body =  params[:question][:body]
    @question.resolved = false

    if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "questions" SET "title" = ?, "body" = ?, "resolved" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["title", "Edited post1!"], ["body", "This post is now resolved!"], ["resolved", true], ["updated_at", 2017-03-08 20:36:09 UTC], ["id", 3]]
---
  def update
    @question = Question.find(params[:id])

    @question.title = params[:question][:title]
    @question.body =  params[:question][:body]
    @question.resolved = params[:question][:resolved]

    if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 1]]
---
  def destroy
    @question = Question.find(params[:id])

    if @question.destroy