app/controllers/topics_controller.rb

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
   def show
      @topic = Topic.find(params[:id])

INSERT INTO "topics" ("name", "public", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Topic #1"], ["public", false], ["description", "This is the description of my topic!"], ["created_at", 2017-03-09 22:41:38 UTC], ["updated_at", 2017-03-09 22:41:38 UTC]]
---
   def create
      @topic = Topic.new

      @topic.name = params[:topic][:name]
      @topic.description = params[:topic][:description]
      @topic.public = params[:topic][:public]

      if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
   def edit
      @topic = Topic.find(params[:id])

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "topics" SET "name" = ?, "description" = ?, "public" = ?, "updated_at" = ? WHERE "topics"."id" = ?
---
   def update
      @topic = Topic.find(params[:id])
      @topic.name = params[:topic][:name]
      @topic.description = params[:topic][:description]
      @topic.public = params[:topic][:public]

      if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 3]]
---
   def destroy
      @topic = Topic.find(params[:id])

      if @topic.destroy